docs: add architecture.md (#12)
